# https://github.com/Homebrew/homebrew-bundle
# Usage: `brew bundle`

# ┌─────────────────────────────────┐
# │ Taps (Third-Party Repositories) |
# └─────────────────────────────────┘

tap "dokku/repo"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"

# ┌──────────┐
# │ Packages |
# └──────────┘

brew "asdf"
# brew "awscli"
brew "ccat"
brew "colordiff"
brew "ctags"
brew "curl"
brew "ffmpeg", args: %w[with-freetype with-libass]
brew "ghostscript"
brew "git"
brew "gnupg"
brew "highlight"
brew "imagemagick"
brew "openssl"
brew "macvim"
brew "mas"
brew "postgresql@13", restart_service: true, link: true
brew "python"
brew "redis", restart_service: true
brew "rsync"
brew "s3cmd"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "dokku/repo/dokku"
brew "heroku/brew/heroku"
brew "puma/puma/puma-dev"

# ┌───────────────────────┐
# │ Cask (GUI macOS apps) |
# └───────────────────────┘

cask_args appdir: "/Applications"

# cask "android-platform-tools" # https://developer.android.com/studio/releases/platform-tools.html
# cask "android-studio" # https://developer.android.com/studio
# cask "aws-vault" # https://github.com/99designs/aws-vault
cask "chromedriver" # http://chromedriver.chromium.org/
cask "docker" # https://www.docker.com/
cask "insomnia" # https://insomnia.rest/
cask "iterm2" # https://iterm2.com/
# cask "keybase" # https://keybase.io/
# cask "mactex" # https://www.tug.org/mactex/ (Latex)
cask "macvim" # https://github.com/macvim-dev/macvim
# cask "obs" # https://obsproject.com/
# cast "phantomjs"
# cask "prince" # https://www.princexml.com/
cask "postico" # https://eggerapps.at/postico/
cask "rectangle" # https://rectangleapp.com/
# cask "sequel-pro" # https://www.sequelpro.com/
# cask "spotmenu" # https://kmikiy.github.io/SpotMenu/
cask "windscribe" # https://windscribe.com/

# ┌───────────────┐
# │ Mac App Store │
# └───────────────┘

mas "Amphetamine", id: 937984704
mas "Claquette", id: 587748131
mas "DaisyDisk", id: 411643860
mas "Droplr", id: 498672703
mas "Gemini 2", id: 1090488118
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "PhotoMill", id: 778590574
mas "Pixelmator Pro", id: 1289583905
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Twitter", id: 1482454543
mas "WhatsApp", id: 1147396723
# mas "Xcode", id: 497799835
